:PROPERTIES:
:ID:       ae7fc8d9-0053-45b6-92f4-9a42f1565718
:ROAM_ALIASES: cpp程序内存布局
:END:
#+title: C++程序内存布局
#+filetags: cpp

* Footnotes

[fn:1]
#+begin_src cpp :results output :namespaces std :includes <iostream> <cstdlib> <cstdint>
// 全局变量（数据段）
int g_a = 10;
int g_b = 10;

// 全局常量（代码段-常量区）
const int c_g_a = 10;
const int c_g_b = 10;

// 全局静态变量（数据段）
static int s_g_a = 11;
static int s_g_b = 11;

int main() {
  // 局部变量（栈）
  int a = 10;
  int b = 10;

  // 静态局部变量（数据段）
  static int s_l_a = 10;
  static int s_l_b = 10;

  // 局部常量（栈）
  const int c_l_a = 10;
  const int c_l_b = 10;

  // 堆区内存（堆）
  int* p_l_a = new int(100);
  int* p_l_b = new int(100);

  // 地址打印
  cout << "局部变量a         ：" << reinterpret_cast<uintptr_t>(&a) << endl;
  cout << "局部变量b         ：" << reinterpret_cast<uintptr_t>(&b) << endl;

  cout << "const局部变量c_l_a：" << reinterpret_cast<uintptr_t>(&c_l_a) << endl;
  cout << "const局部变量c_l_b：" << reinterpret_cast<uintptr_t>(&c_l_b) << endl;
  cout << '\n';

  cout << "全局变量g_a        ：" << reinterpret_cast<uintptr_t>(&g_a) << endl;
  cout << "全局变量g_b        ：" << reinterpret_cast<uintptr_t>(&g_b) << endl;

  cout << "static全局变量s_g_a：" << reinterpret_cast<uintptr_t>(&s_g_a) << endl;
  cout << "static全局变量s_g_b：" << reinterpret_cast<uintptr_t>(&s_g_b) << endl;
  cout << "static局部变量s_l_a：" << reinterpret_cast<uintptr_t>(&s_l_a) << endl;
  cout << "static局部变量s_l_b：" << reinterpret_cast<uintptr_t>(&s_l_b) << endl;
  cout << '\n';

  cout << "const全局变量c_g_a ：" << reinterpret_cast<uintptr_t>(&c_g_a) << endl;
  cout << "const全局变量c_g_b ：" << reinterpret_cast<uintptr_t>(&c_g_b) << endl;
}
#+end_src

#+RESULTS:
#+begin_example
局部变量a         ：140730249679336
局部变量b         ：140730249679340
const局部变量c_l_a：140730249679344
const局部变量c_l_b：140730249679348

全局变量g_a        ：94857618763848
全局变量g_b        ：94857618763852
static全局变量s_g_a：94857618763856
static全局变量s_g_b：94857618763860
static局部变量s_l_a：94857618763864
static局部变量s_l_b：94857618763868

const全局变量c_g_a ：94857618755588
const全局变量c_g_b ：94857618755592
#+end_example


[fn:2]
#+begin_src cpp :results output :namespaces std :includes <iostream> <cstddef>
std::size_t length{};
std::cin >> length;
int* array{ new int[length]{} }; // NOTE 动态分配的数组，长度不需要为常量表达式
array[0] = 5;
delete[] array;                  // 删除动态数组

int* array{ new int[5]{ 9, 7, 5, 3, 1 } };  // 列表初始化
auto* array{ new int[5]{ 9, 7, 5, 3, 1 } }; // 使用 auto 避免写两次 类型
#+end_src

[fn:3]
#+begin_src cpp
int* value { new (std::nothrow) int{} }; // 分配内存失败返回空指针
if (!value) {                            // 判断是否分配成功
    std::cerr << "Could not allocate memory\n";
}
#+end_src
